Repository: ojs-services/ojs-required-submission-files
Catalog: locale/*/locale.po
Languages: tr_tr

# plugins.generic.requiredFiles.displayName
source: Required Submission Files
tr_tr: Zorunlu Gönderi Dosyaları

# plugins.generic.requiredFiles.description
source: Allows editors to mark specific article component types as required during submission. Authors must upload at least one file of each required type before proceeding past the upload step.
tr_tr: Editörlerin gönderi sırasında belirli makale bileşen türlerini zorunlu olarak işaretlemesine olanak tanır. Yazarlar, yükleme adımını geçmeden önce her zorunlu türde en az bir dosya yüklemelidir.

# plugins.generic.requiredFiles.settings.description
source: Select which file types authors must upload during submission
tr_tr: Yazarların gönderi sırasında yüklemesi gereken dosya türlerini seçin

# plugins.generic.requiredFiles.settings.note
source: This list reflects the article components defined in your journal. To add or modify component types, go to Workflow > Submission > Components.
tr_tr: Bu liste derginizdeki makale bileşen türlerini yansıtır. Yeni tür eklemek veya mevcut türleri düzenlemek için İş Akışı > Gönderi > Bileşenler bölümünü kullanın.

# plugins.generic.requiredFiles.validation.missingFiles
source: The following required files are missing: {$fileTypes}. Please upload at least one file of each required type before continuing.
tr_tr: Şu zorunlu dosyalar eksik: {$fileTypes}. Devam etmeden önce lütfen her zorunlu türde en az bir dosya yükleyin.

# plugins.generic.requiredFiles.validation.errorTitle
source: Missing Required Files
tr_tr: Eksik Zorunlu Dosyalar

# plugins.generic.requiredFiles.validation.uploadError
source: Upload failed. Please try again.
tr_tr: Yükleme başarısız oldu. Lütfen tekrar deneyin.

# plugins.generic.requiredFiles.banner.title
source: Required Files:
tr_tr: Zorunlu Dosyalar:

# plugins.generic.requiredFiles.section.required
source: Required Files
tr_tr: Zorunlu Dosyalar

# plugins.generic.requiredFiles.section.optional
source: Uploaded Files
tr_tr: Yüklenen Dosyalar

# plugins.generic.requiredFiles.status.notUploaded
source: Not uploaded
tr_tr: Yüklenmedi

# plugins.generic.requiredFiles.status.uploaded
source: Uploaded
tr_tr: Yüklendi

# plugins.generic.requiredFiles.action.chooseFile
source: Choose File
tr_tr: Dosya Seç

# plugins.generic.requiredFiles.action.replace
source: Replace
tr_tr: Değiştir
